Repository: lavandejoey/ZiyiLiu.top
Catalog: MainApplication/translations/*/LC_MESSAGES/messages.po
Languages: fr

source: Hi, I'm
fr: Bonjour, je suis

source: Home
fr: Accueil

source: Portfolio
fr: Portefeuille

source: About
fr: À propos

source: User Profile
fr: Profil d'utilisateur

source: Dashboard
fr: Tableau de bord

source: Log Out
fr: Déconnexion

source: Log In
fr: Connexion

source: Sign Up
fr: S'inscrire

source: All Rights Reserved
fr: Tous les droits sont réservés

source: Login
fr: Connexion

source: User not found.
fr: L'utilisateur n'a pas été trouvé.

source: Sign up here
fr: S'inscrire ici

source: Login failed. Please check your credentials.
fr: Échec de la connexion. Veuillez vérifier vos informations d'identification.

source: Username / Email / Phone:
fr: Utilisateur/E-mail/Téléphone:

source: Password:
fr: Mot de passe:

source: Don't have an account?
fr: Vous n'avez pas de compte?

source: Sign up here!
fr: Inscrivez-vous ici!

source: User already exists. Try a different one or
fr: Cet utilisateur existe déjà. Essayez-en un autre ou

source: login
fr: connectez-vous.

source: Username:
fr: Utilisateur:

source: Confirm Password:
fr: Confirmez le mot de passe:

source: Already have an account?
fr: Vous avez déjà un compte?

source: Log in here
fr: Connectez-vous ici

source: Phone:
fr: Téléphone:

source: Groups:
fr: Groupes:

source: Created At:
fr: Créé à:

source: Updated At:
fr: Mis à jour à:

source: Error
fr: Erreur

source: Sorry, something went wrong. Please check the URL or try again later.
fr: Désolé, quelque chose s'est mal passé. Veuillez vérifier l'URL ou réessayer plus tard.

source: Thank you for your message!
fr: Merci pour votre message!

source: I will get back to you as soon as possible.
fr: Je vous répondrai dès que possible.

source: Redirecting in <span id='timer'>5</span> seconds...
fr: Redirection dans <span id='timer'>5</span> secondes...

source: <span>Why not E-mailing me to say&nbsp;</span><div class='d-inline' id='hello'></div>
fr: <span>Pourquoi ne pas e-mail à&nbsp;</span><div class='d-inline' id='hello'></div>

source: <span>Or you can find me on</span><div class='d-inline' id='social' style='position: relative;bottom: -3px;'></div><span>as well!</span>
fr: <span>Ou vous pouvez me trouver sur</span><div class='d-inline' id='social' style='position: relative;bottom: -3px;'></div><span>aussi!</span>

source: Your preferred name&quest;
fr: Votre nom préféré&quest;

source: Where can I reach you via email?
fr: Où puis-je vous joindre par e-mail?

source: Plz feel free to send whatever you want to talk with me!
fr: N'hésitez pas à envoyer tout ce dont vous voulez parler avec moi&nbsp;!

source: Say Hello
fr: Salut~

source: Click to Save PDF~
fr: Cliquez pour enregistrer PDF~

source: CV/Résumé PDF Downloader
fr: Télécharger de CV/Résumé PDF

source: Please choose the version you want!
fr: S'il vous plaît choisir la version que vous voulez!

source: Close
fr: Fermer

source: East China University of Science and Technology, Meilong Rd., Xuhui District, Shanghai, China
fr: Université des sciences et technologies de l'Est de la Chine, Meilong Rd., district de Xuhui, Shanghai, Chine

source: Education
fr: Éducation

source: East China University of Science and Technology
fr: Université des sciences et technologies de l'est de la Chine

source: Jul, 2024
fr: juil, 2024

source: BEng Major in Intelligence and Robotics (Robotics).
fr: BEng Majeure en intelligence et robotique (robotique).

source: Relevant Courses:
fr: Cours pertinents:

source: Mathematical Foundations for Artificial Intelligence
fr: Mathématiques fondamentales pour l'intelligence artificielle

source: Principles and Design of Embedded Systems
fr: Principes et conception des systèmes embarqués

source: Pattern Learning and Machine Learning
fr: Apprentissage de modèles et apprentissage automatique

source: Machine Learning Tools and Platforms
fr: Outils et plates-formes d'apprentissage automatique

source: Robotics Principles and Design
fr: Principes et conception de la robotique

source: Computer Graphic
fr: Graphique par ordinateur

source: Feb, 2023
fr: fév, 2023

source: Mini-major Diploma Major in Computer Science and Technology
fr: Diplôme de mini-majeure en informatique et technologie

source: Relevant courses:
fr: Cours pertinents:

source: Data Structures and Algorithms, Principles of Database Systems, Operating Systems, Software Engineering, Computer Networking.
fr: Structures de données et algorithmes, principes des systèmes de base de données, systèmes d'exploitation, génie logiciel, réseautage informatique.

source: Internship
fr: Stage

source: Bank of Communication Financial Technology Co,Ltd.
fr: Banque de communication Financial Technology Co,Ltd.

source: Dec, 2022
fr: déc, 2022

source: Back-end Developer
fr: Développeur back-end

source: Created an updated HRM using a low-code platform and its APIs, designed its relational database and automated the process from pre-employment to employee management.
fr: Créé un HRM mis à jour à l'aide d'une plate-forme à faible code et de ses API, conçu sa base de données relationnelle et automatisé le processus de la pré-embauche à la gestion des employés.

source: Developed OCR APIs for HRM (Human Resource Management) using the OpenAPI standard, improving the efficiency and accuracy of data capture.
fr: Développé des API OCR pour HRM (gestion des ressources humaines) en utilisant la norme OpenAPI, améliorant l'efficacité et la précision de la capture de données.

source: Participated in the DevOps process for the company's supply chain and debt management platform, contributing to integration testing, compilation, deployment and test case management.
fr: Participé au processus DevOps pour la chaîne d'approvisionnement et la plate-forme de gestion de la dette de l'entreprise, contribuant aux tests d'intégration, à la compilation, au déploiement et à la gestion des cas de test.

source: ISCAS (Institute of Software Chinese Academy of Sciences)
fr: ISCAS (Institut de logiciels de les académies scientifiques et technologiques de Chine)

source: Apr, 2022
fr: avr, 2022

source: Development and Testing
fr: Développement et test

source: Tested and packaged software such as Autoconf-2.13 and Pijul on the openEuler platform, ensuring compatibility and functionality within the openEuler operating system.
fr: Testé et empaqueté des logiciels tels que Autoconf-2.13 et Pijul sur la plate-forme openEuler, assurant la compatibilité et la fonctionnalité dans le système d'exploitation openEuler.

source: Developed "rsensleak" partially, a document-sensitive information recognition tool based on Rust, which analyses documents and identifies sensitive information such as passwords, key tokens, and private information.
fr: Développé "rsensleak" partiellement, un outil de reconnaissance d'informations sensibles aux documents basé sur Rust, qui analyse les documents et identifie les informations sensibles telles que les mots de passe, les jetons clés et les informations privées.

source: Academic Projects
fr: Projets académiques

source: Light pollution assessment and prediction (COMAP Interdisciplinary Contest in Modelling (ICM))
fr: Évaluation et prédiction de la pollution lumineuse (Concours interdisciplinaire de modélisation COMAP (ICM))

source: Programmer
fr: Programmeur

source: Developing a light pollution level evaluation system, utilising data related to social development, industrial levels, and ecological conditions as evaluation variables.&nbsp;
fr: Développement d'un système d'évaluation du niveau de pollution lumineuse, utilisant des données liées au développement social, aux niveaux industriels et aux conditions écologiques comme variables d'évaluation.&nbsp;

source: Collecting, cleaning and mining historical data in eight different eastern and western United States regions, and the data extracted from satellite remote sensing maps and GIS information as criteria for current light pollution levels. Fitting them to conduct the evaluation index parameters.&nbsp;
fr: Collecte, nettoyage et extraction de données historiques dans huit régions différentes des États-Unis orientaux et occidentaux, et les données extraites de cartes de télédétection par satellite et d'informations SIG comme critères pour les niveaux actuels de pollution lumineuse. Les ajuster pour mener les paramètres d'indice d'évaluation.&nbsp;

source: Using both subjective and objective evaluation methods, including individual evaluations using DEMATEL and network analysis (ANP). And using multiple regression analysis for accurate testing and assessment.
fr: Utilisation de méthodes d'évaluation subjectives et objectives, y compris des évaluations individuelles à l'aide de DEMATEL et d'analyses de réseau (ANP). Et en utilisant l'analyse de régression multiple pour des tests et une évaluation précis.

source: Time Series Based Climate Prediction and Attribution Analysis (APMCM Mathematical Modeling Contest)
fr: Prédiction du climat et analyse d'attribution basées sur les séries chronologiques (Concours de modélisation mathématique APMCM)

source: Built ARIMA and XGboost model to predict global temperature rise, found temperature will reach 20°C in 2048.&nbsp;
fr: Construit un modèle ARIMA et XGboost pour prédire l'augmentation de la température mondiale, a constaté que la température atteindra 20°C en 2048.&nbsp;

source: Conducted hypothesis testing and got a 97.6872&percnt; probability to reject the assumption of no abnormal rise in March 2022 due to the potential effect of the global epidemic.&nbsp;
fr: A mené des tests d'hypothèses et a obtenu une probabilité de 97,6872&percnt; de rejeter l'hypothèse d'une augmentation anormale en mars 2022 en raison de l'effet potentiel de l'épidémie mondiale.&nbsp;

source: Used PC algorithm and DTW to attribute temperature change to human activities dominating natural factors.
fr: Utilisé l'algorithme PC et DTW pour attribuer le changement de température aux activités humaines dominant les facteurs naturels.

source: Signal base station siting problem (MathorCup Mathematical Modeling Program)
fr: Problème d'emplacement de la station de base de signal (programme de modélisation mathématique MathorCup)

source: Implemented a particle swarm optimization model with additional coordinates as guide terms for central base station planning using K-Means clustering and incorporated coordinates based on greedy thinking for branch base station planning. I enhanced signal base station optimization by partitioning map outliers.&nbsp;
fr: Implémenté un modèle d'optimisation par essaim de particules avec des coordonnées supplémentaires comme termes de guidage pour la planification de la station de base centrale en utilisant le regroupement K-Means et incorporé des coordonnées basées sur la pensée gourmande pour la planification de la station de base de branche. J'ai amélioré l'optimisation de la station de base de signal en partitionnant les valeurs aberrantes de la carte.&nbsp;

source: Refined base station coverage boundary into three principal directions, calculating coverage using an approximation of a circle of equal area. The line connecting the base station centre and the circle determined the main direction of signal emission.&nbsp;
fr: Raffiné la limite de couverture de la station de base en trois directions principales, calculant la couverture à l'aide d'une approximation d'un cercle de surface égale. La ligne reliant le centre de la station de base et le cercle a déterminé la direction principale d'émission du signal.&nbsp;

source: The improved PSO demonstrated faster convergence and higher accuracy, with final model parameters extracted with an error of less than 2&percnt;, outperforming the traditional BOKM algorithm.
fr: Le PSO amélioré a démontré une convergence plus rapide et une plus grande précision, les paramètres du modèle final étant extraits avec une erreur de moins de 2&percnt;, surpassant l'algorithme BOKM traditionnel.

source: Speech-Recognition-Based Mechanical System for Lift Control
fr: Système mécanique de contrôle de levage basé sur la reconnaissance vocale

source: Apr, 2021
fr: avr, 2021

source: Jun, 2021
fr: juin, 2021

source: Software Developer and Tester
fr: Développeur et testeur de logiciels

source: Developed a Raspberry Pi-based lift control mechanism, utilizing stepper motors, magnetic switches, and Huawei's voice recognition API for contactless operations during pandemics.&nbsp;
fr: Développé un mécanisme de contrôle de levage basé sur Raspberry Pi, utilisant des moteurs pas à pas, des commutateurs magnétiques et l'API de reconnaissance vocale de Huawei pour des opérations sans contact pendant les pandémies.&nbsp;

source: This Python-controlled innovation secured the second prize at the 10th Shanghai City University Students Mechanical Engineering Innovation Contest.
fr: Cette innovation contrôlée par Python a remporté le deuxième prix du 10e concours d'innovation en génie mécanique des étudiants universitaires de la ville de Shanghai.

source: Reward and Certifications
fr: Récompenses et certifications

source: Huawei "Intelligence Base" Outstanding Student Scholarship (Level B, selection rate 1&percnt;);
fr: La bourse d'études exceptionnelle "Intelligence Base" de Huawei (niveau B, taux de sélection 1&percnt;);

source: The Shanghai College Information Technology Level Examination in Big Data and Cloud Computing, Level 4 (Mar, 2023, Highest Level);
fr: L'examen de niveau d'information sur la technologie des collèges de Shanghai en matière de mégadonnées et de cloud computing, niveau 4 (mars 2023, niveau le plus élevé);

source: The Shanghai College Information Technology Level Examination in C Programming and Application, Level 3 (Jan, 2022, Highest Level);
fr: L'examen de niveau d'information sur la technologie des collèges de Shanghai en programmation C et en application, niveau 3 (janvier 2022, niveau le plus élevé);

source: Successful Participant in COMAP Interdisciplinary Contest in Modelling (ICM) (Jun, 2021);
fr: Participant réussi au concours de modélisation interdisciplinaire COMAP (ICM) (juin 2021);

source: Successful Participant in Asia and Pacific Mathematical Contest in Modeling (Feb, 2023);
fr: Participant réussi au concours de modélisation mathématique d'Asie et du Pacifique (fév, 2023);

source: Third Prize of the 12th National E-Commerce "Innovation, Creativity and Entrepreneurship" Challenge Contest (Jun, 2022);
fr: Troisième prix du 12e concours national de défi "Innovation, créativité et entrepreneuriat" du commerce électronique (juin 2022);

source: The Second Prize in 10th University Students Mechanical Engineering Innovation Contest, Shanghai (Nov, 2022).
fr: Le deuxième prix du 10e concours d'innovation en génie mécanique des étudiants universitaires, Shanghai (nov, 2022).

source: EXTRACURRICULAR ACTIVITIES
fr: ACTIVITÉS EXTRASCOLAIRES

source: School Publicity and Media Sector of Youth League Committee, East China University of Science and Technology
fr: Secteur de la publicité et des médias scolaires du comité de la ligue de la jeunesse, Université des sciences et technologies de l'est de la Chine

source: Aug, 2022
fr: août, 2022

source: Head of Department
fr: Chef de département

source: Coordinated the day-to-day work of a 20-member working group. Ran the operation of the college's WeChat official account, "Huali Xinyuan", which has 7,000+ active users and has been awarded "4-star member media" by the Shanghai University Media Union for two consecutive years (2020 and 2021);
fr: Coordonné le travail quotidien d'un groupe de travail de 20 membres. A dirigé le fonctionnement du compte officiel WeChat du collège, "Huali Xinyuan", qui compte plus de 7 000 utilisateurs actifs et a été nommé "média membre 4 étoiles" par l'Union des médias universitaires de Shanghai pendant deux années consécutives (2020 et 2021);

source: Organised college-wide freshers' icebreakers with over 300 participants. Held two "Geek Festivals" in which we joined forces with other colleges and companies, such as Dell and Huawei, and promoted information technology interestingly and diversely, engaging people in creativity and hands-on work.
fr: Organisé des brise-glaces pour les nouveaux arrivants dans tout le collège avec plus de 300 participants. A organisé deux "festivals des geeks" dans lesquels nous avons uni nos forces avec d'autres collèges et entreprises, telles que Dell et Huawei, et promu la technologie de l'information de manière intéressante et diversifiée, engageant les gens dans la créativité et le travail pratique.

source: LANGUAGE AND SKILLS
fr: LANGUE ET COMPÉTENCES

source: Native in Mandarin; fluent in Cantonese;
fr: Langue maternelle en mandarin; couramment en cantonais;

source: Proficient in English (IELTS 6.5, CET-6 583), Beginner in French;
fr: Maîtrise de l'anglais (IELTS 6,5, CET-6 583), débutant en français;

source: AHA Heartsaver Basic Life Support and CPR Certificate, American Heart Association, 2022;
fr: Certificat de base de soutien de base à la vie et de RCP Heartsaver AHA, American Heart Association, 2022;

source: Proficient in Microsoft Office, SPSS, Origin, MATLAB, and other office software;
fr: Maîtrise de Microsoft Office, SPSS, Origin, MATLAB et autres logiciels de bureau;

source: Programming Tool: Linux, C/C++, Python, Rust, SQL, HTML, CSS, SCSS, JavaScript, \LaTeX, Markdown;
fr: Outil de programmation: Linux, C/C++, Python, Rust, SQL, HTML, CSS, SCSS, JavaScript, \LaTeX, Markdown;

source: Development Tool: Git, Docker, Kubernetes, OpenAPI, Postman, Swagger;
fr: Outil de développement: Git, Docker, Kubernetes, OpenAPI, Postman, Swagger;

source: Development Framework: Flask, Django, Bootstrap, jQuery, Node.js.
fr: Cadre de développement: Flask, Django, Bootstrap, jQuery, Node.js.

source: Directory
fr: Répertoire

source: items
fr: éléments

source: I am
fr: Je suis

source: const descriptionStr = ["striving at engineering.", "Journeying through the tech and design.", "Luminous harnessing tech power for inclusive future.", "Zealous to slightly differ the world.", "Yearning to engineer awe-inspiring wonders."];
fr: const descriptionStr = ["en train de m\'efforcer pour devenir ingénieur.", "Joyeux face aux possibilités offertes par la technologie et le design.", "Lucide en exploitant le pouvoir de la technologie pour un avenir inclusif.", "Zélé pour différencier légèrement le monde.", "Ympatient d\'ingénierer des merveilles inspirantes."];

source: ABOUT:
fr: À PROPOS:

source: Powered by:
fr: Propulsé par:

source: Incorrect password
fr: Mot de passe incorrect

source: User not found
fr: L'utilisateur n'a pas été trouvé.

source: User already exists. Try a different one or log in.
fr: Cet utilisateur existe déjà. Essayez-en un autre ou

source: Email already exists. Try a different one or log in.
fr: L'e-mail existe déjà. Essayez-en un autre ou

source: Account created. You can now log in.
fr: Compte créé. Vous pouvez maintenant vous connecter.

source: Username must be between 4 and 32 characters
fr: Le nom d'utilisateur doit comporter entre 4 et 32 caractères

source: Password must be between 6 and 64 characters
fr: Le mot de passe doit comporter entre 6 et 64 caractères

source: Passwords must match
fr: Les mots de passe doivent correspondre

source: Invalid email address
fr: Adresse e-mail invalide

source: You have been logged out.
fr: Vous avez été déconnecté.

source: Internal Server Error
fr: Erreur interne du serveur

source: Not Implemented
fr: Non implémenté

source: Bad Gateway
fr: Passerelle incorrecte

source: Contact Me
fr: Me contacter

source: You must be logged in to access this page.
fr: Vous devez être connecté pour accéder à cette page.

source: You are not authorized to access this page.
fr: Vous n'êtes pas autorisé à accéder à cette page.

source: Files
fr: Fichiers
