Repository: lavandejoey/ZiyiLiu.top
Catalog: MainApplication/translations/yue/LC_MESSAGES/messages.po
Languages: yue

source: Hi, I'm
yue: 你好，我係

source: Joshua LIU
yue: 劉子藝&nbsp;(Joshua)

source: Home
yue: 主頁

source: Portfolio
yue: 作品集

source: About
yue: 關於我

source: Contact
yue: 同我傾

source: User Profile
yue: 用戶資料

source: Dashboard
yue: 控制台

source: Log Out
yue: 登出

source: Log In
yue: 登入

source: Sign Up
yue: 註冊

source: All Rights Reserved
yue: 版權所有

source: Ziyi Joshua LIU
yue: 劉子藝&nbsp;(Joshua)

source: Login
yue: 登入

source: User not found.
yue: 用戶未找到。

source: Sign up here
yue: 喺度註冊

source: Login failed. Please check your credentials.
yue: 登入失敗。請檢查你嘅用戶名同密碼。

source: Username / Email / Phone:
yue: 用戶名/電郵/電話：

source: Password:
yue: 密碼：

source: Don't have an account?
yue: 仲冇帳戶？

source: Sign up here!
yue: 喺度註冊！

source: User already exists. Try a different one or
yue: 用戶名已經存在。試下揀一個新嘅或者

source: login
yue: 登入

source: Username:
yue: 用戶名：

source: Confirm Password:
yue: 確認密碼：

source: Email:
yue: 電郵：

source: Already have an account?
yue: 已經有帳戶？

source: Log in here
yue: 由呢度登入

source: Phone:
yue: 電話：

source: Groups:
yue: 組：

source: Created At:
yue: 創建於：

source: Updated At:
yue: 更新於：

source: Error
yue: 錯誤

source: Sorry, something went wrong. Please check the URL or try again later.
yue: 對唔住，出咗啲問題。請檢查網址或者過一陣再試。

source: Thank you for your message!
yue: 多謝你嘅留言！

source: I will get back to you as soon as possible.
yue: 我會盡快覆你。

source: Redirecting in <span id='timer'>5</span> seconds...
yue: <span id='timer'>5</span> 秒後自動跳轉...

source: <span>Why not E-mailing me to say&nbsp;</span><div class='d-inline' id='hello'></div>
yue: <span>點解唔 E-mail 同我 say&nbsp;</span><div class='d-inline' id='hello'></div>

source: <span>Or you can find me on</span><div class='d-inline' id='social' style='position: relative;bottom: -3px;'></div><span>as well!</span>
yue: <span>你都可以喺&nbsp;</span><div class='d-inline' id='social' style='position: relative;bottom: -3px;'></div><span>&nbsp;度搵到我！</span>

source: Your preferred name&quest;
yue: 點樣稱呼你？

source: Where can I reach you via email?
yue: 你嘅電郵？

source: Plz feel free to send whatever you want to talk with me!
yue: 請隨意傳送你想同我傾嘅嘢！

source: &nbsp;&quest;
yue: &nbsp;？

source: Click to Save PDF~
yue: 點呢度載入 PDF~

source: CV/Résumé PDF Downloader
yue: CV/履歷表 PDF 下載器

source: Please choose the version you want!
yue: 請揀你想要嘅文件！

source: Close
yue: 關閉

source: East China University of Science and Technology, Meilong Rd., Xuhui District, Shanghai, China
yue: 中國上海市徐匯區梅隴路華東理工大學

source: Education
yue: 教育經歷

source: East China University of Science and Technology
yue: 華東理工大學

source: Sept, 2020
yue: 2020年9月

source: Jul, 2024
yue: 2024年7月

source: BEng Major in Intelligence and Robotics (Robotics).
yue: 工程學士，智能與機器人（機器人方向）。

source: Relevant Courses:
yue: 相關課程：

source: Mathematical Foundations for Artificial Intelligence
yue: 人工智能數學基礎

source: Principles and Design of Embedded Systems
yue: 嵌入式系統原理與設計

source: Pattern Learning and Machine Learning
yue: 模式識別與機器學習

source: Machine Learning Tools and Platforms
yue: 機器學習工具與平台

source: Robotics Principles and Design
yue: 機器人原理與設計

source: Computer Graphic
yue: 計算機圖形學

source: Oct, 2021
yue: 2021年10月

source: Feb, 2023
yue: 2023年2月

source: Mini-major Diploma Major in Computer Science and Technology
yue: 微專業，計算機科學與技術

source: Relevant courses:
yue: 相關課程：

source: Data Structures and Algorithms, Principles of Database Systems, Operating Systems, Software Engineering, Computer Networking.
yue: 數據結構與算法，數據庫系統原理，操作系統，軟件工程，計算機網絡。

source: Internship
yue: 實習經驗

source: Bank of Communication Financial Technology Co,Ltd.
yue: 交銀金融科技有限公司

source: Dec, 2022
yue: 2022年12月

source: Back-end Developer
yue: 後端開發

source: Created an updated HRM using a low-code platform and its APIs, designed its relational database and automated the process from pre-employment to employee management.
yue: 使用低代碼平颱及平颱 API 搭建新的人力資源信息管理繫統，設計了繫統的數據庫關繫，實現了從求職者預錄用到員工入職及解約的數據信息管理的自動化。

source: Developed OCR APIs for HRM (Human Resource Management) using the OpenAPI standard, improving the efficiency and accuracy of data capture.
yue: 基於 OpenAPI 標準爲 HRM（人力資源管理）開發 OCR API，提高了繫統的數據採集效率和準確性。

source: Participated in the DevOps process for the company's supply chain and debt management platform, contributing to integration testing, compilation, deployment and test case management.
yue: 參與公司供應鏈和債權管理平颱的 DevOps 進程，參與設計平颱 30 多個 API 與 10 餘個頁麵 UI 測試用例。

source: ISCAS (Institute of Software Chinese Academy of Sciences)
yue: 中國科學院軟件研究所 (ISCAS)

source: Apr, 2022
yue: 2022年4月

source: Sept, 2022
yue: 2022年9月

source: Development and Testing
yue: 軟件研發與測試

source: Tested and packaged software such as Autoconf-2.13 and Pijul on the openEuler platform, ensuring compatibility and functionality within the openEuler operating system.
yue: 使用 RPM 在 openEuler 平颱上測試並打包了針對該操作繫統的 Autoconf-2.13 和 Pijul 等軟件，確保軟件包在 openEuler 操作繫統內的兼容性和功能。

source: Developed "rsensleak" partially, a document-sensitive information recognition tool based on Rust, which analyses documents and identifies sensitive information such as passwords, key tokens, and private information.
yue: 參與開發了“rsensleak”，這是一個基於 Rust 的文檔敏感信息識別工具，可以分析文檔並識別敏感信息，如密碼、密鑰令牌和私人信息。

source: Academic Projects
yue: 學術項目

source: Light pollution assessment and prediction (COMAP Interdisciplinary Contest in Modelling (ICM))
yue: 光污染評估和預測 · 美國大學生數學建模競賽（COMAP-ICM）

source: Programmer
yue: 程序開發

source: Developing a light pollution level evaluation system, utilising data related to social development, industrial levels, and ecological conditions as evaluation variables.&nbsp;
yue: 基於 Python（包括軟件包 NumPy，Pandas 等）實現自行設計的光污染水平評價繫統，利用社會發展、工業水平、生態條件等領域的相關數據作爲評價變量。

source: Collecting, cleaning and mining historical data in eight different eastern and western United States regions, and the data extracted from satellite remote sensing maps and GIS information as criteria for current light pollution levels. Fitting them to conduct the evaluation index parameters.&nbsp;
yue: 針對美國東、西部八個不同發展水平與自然環境的地區曆史數據進行提煉分析，並以對應地區衛星遙感地圖和GIS 信息中的數據作爲其光污染水平的標準，使用回歸擬合方法來構建光污染評價指標的參數權重。

source: Using both subjective and objective evaluation methods, including individual evaluations using DEMATEL and network analysis (ANP). And using multiple regression analysis for accurate testing and assessment.
yue: 使用主、客觀混合評價方法，包括 DEMATEL 和網絡分析（ANP）進行個體評價。並使用多元回歸分析進行準確的測試和評估。

source: Time Series Based Climate Prediction and Attribution Analysis (APMCM Mathematical Modeling Contest)
yue: 基於時間序列的氣候預測和歸因分析 · APMCM 亞太地區大學生數學建模競賽

source: Built ARIMA and XGboost model to predict global temperature rise, found temperature will reach 20°C in 2048.&nbsp;
yue: 建立並比較了 ARIMA、SARIMA 和 XGboost 模型來預測全球溫度上昇；發現溫度將在 2048 年達到 20℃。

source: Conducted hypothesis testing and got a 97.6872&percnt; probability to reject the assumption of no abnormal rise in March 2022 due to the potential effect of the global epidemic.&nbsp;
yue: 根據假設檢驗，得到 97.6872&percnt; 的概率拒絶 2022 年 3 月由於全球流行病的潛在影響而沒有異常上昇的假設。&nbsp;

source: Used PC algorithm and DTW to attribute temperature change to human activities dominating natural factors.
yue: 使用 PC 算法和 DTW 將溫度變化歸因於人類活動主導了自然因素。

source: Signal base station siting problem (MathorCup Mathematical Modeling Program)
yue: 信號基站選址問題 · MathorCup 數學建模

source: Implemented a particle swarm optimization model with additional coordinates as guide terms for central base station planning using K-Means clustering and incorporated coordinates based on greedy thinking for branch base station planning. I enhanced signal base station optimization by partitioning map outliers.&nbsp;
yue: 提出了基於 K-means 聚類算法作引導的宏基站選址方法和基於貪心思想作引導的微基站選址方法。

source: Refined base station coverage boundary into three principal directions, calculating coverage using an approximation of a circle of equal area. The line connecting the base station centre and the circle determined the main direction of signal emission.&nbsp;
yue: 提出了基於K-means聚類算法作引導的宏基站選址方法和基於貪心思想作引導的微基站選址方法；

source: The improved PSO demonstrated faster convergence and higher accuracy, with final model parameters extracted with an error of less than 2&percnt;, outperforming the traditional BOKM algorithm.
yue: 基於Python程序實現的改進PSO表現出更快的收斂速度和更高的精度，最終提取的模型參數誤差小於2&percnt;，優於傳統的BOKM算法。

source: Speech-Recognition-Based Mechanical System for Lift Control
yue: 基於語音識別的外置電梯運行控製機械繫統

source: Apr, 2021
yue: 2021年4月

source: Jun, 2021
yue: 2021年6月

source: Software Developer and Tester
yue: 嵌入式軟件開發與測試

source: Developed a Raspberry Pi-based lift control mechanism, utilizing stepper motors, magnetic switches, and Huawei's voice recognition API for contactless operations during pandemics.&nbsp;
yue: 開發了一個基於 Raspberry Pi 的電梯控製繫統，利用步進電機、磁性開關和華爲語音識別 API，實現傳染病時期電梯的無接觸式操作。

source: This Python-controlled innovation secured the second prize at the 10th Shanghai City University Students Mechanical Engineering Innovation Contest.
yue: 項目成果榮獲第十屆上海城市大學生機械工程創新大賽的二等獎。

source: Reward and Certifications
yue: 獎狀與証書

source: Huawei "Intelligence Base" Outstanding Student Scholarship (Level B, selection rate 1&percnt;);
yue: 華爲 "智慧基座" 優秀學生獎學金（2021年11月，B級）；

source: The Shanghai College Information Technology Level Examination in Big Data and Cloud Computing, Level 4 (Mar, 2023, Highest Level);
yue: 通過上海市高等學校信息技術水平考試大數據與雲計算，四級（最高等級，2023年03月）；

source: The Shanghai College Information Technology Level Examination in C Programming and Application, Level 3 (Jan, 2022, Highest Level);
yue: 通過上海市高等學校信息技術水平考試C程序設計及應用，三級（最高等級，2022年01月）；

source: Successful Participant in COMAP Interdisciplinary Contest in Modelling (ICM) (Jun, 2021);
yue: 美國大學生數學建模競賽（COMAP-ICM）S 獎（2023年02月）；

source: Successful Participant in Asia and Pacific Mathematical Contest in Modeling (Feb, 2023);
yue: APMCM 亞太地區大學生數學建模競賽 S 獎（2022年11月）；

source: Third Prize of the 12th National E-Commerce "Innovation, Creativity and Entrepreneurship" Challenge Contest (Jun, 2022);
yue: 第十二屆全國大學生電子商務“創新、創意及創業”挑戰賽三等獎（2022年06月）；

source: The Second Prize in 10th University Students Mechanical Engineering Innovation Contest, Shanghai (Nov, 2022).
yue: 第十屆上海市大學生機械工程創新大賽二等獎（2021年06月）。

source: EXTRACURRICULAR ACTIVITIES
yue: 社會服務與課外活動

source: School Publicity and Media Sector of Youth League Committee, East China University of Science and Technology
yue: 華東理工大學信息學院團委信息宣傳與傳媒中心

source: Aug, 2022
yue: 2022年8月

source: Head of Department
yue: 部門負責人

source: Coordinated the day-to-day work of a 20-member working group. Ran the operation of the college's WeChat official account, "Huali Xinyuan", which has 7,000+ active users and has been awarded "4-star member media" by the Shanghai University Media Union for two consecutive years (2020 and 2021);
yue: 組織、協調約20人的部門日常工作,主要爲學院微信公衆號和“Bilibili”賬號設計宣傳內容，拍攝活動資料，策劃學院活動。學院微信公衆號“華理信院”截至卸任賬號擁有7000+活躍用戶，連續兩年（2020、2021）獲評“中青校媒（上海）四星會員媒體”；

source: Organised college-wide freshers' icebreakers with over 300 participants. Held two "Geek Festivals" in which we joined forces with other colleges and companies, such as Dell and Huawei, and promoted information technology interestingly and diversely, engaging people in creativity and hands-on work.
yue: 兩次組織了全院的新生破冰活動“畫佈大賽”，參與人數超過300人。帶領部門主辦了兩屆“極客節”，通過與其他學院及戴爾、華爲等公司合作，以多元化的遊戲、競技、課堂，引導大家探究技術、參與創新。

source: LANGUAGE AND SKILLS
yue: 語言及其他技能能力

source: Native in Mandarin; fluent in Cantonese;
yue: 中文普通話：母語；廣東話：熟練應用；

source: Proficient in English (IELTS 6.5, CET-6 583), Beginner in French;
yue: 英文：CET-6（IELTS 6.5, CET-6 583）；

source: AHA Heartsaver Basic Life Support and CPR Certificate, American Heart Association, 2022;
yue: 美國心臟協會基礎生命支持(BLS)與心肺復甦(CPR)証書，美國心臟協會，2022年；

source: Proficient in Microsoft Office, SPSS, Origin, MATLAB, and other office software;
yue: 熟練使用Microsoft Office、SPSS、Origin、MATLAB等辦公軟件；

source: Programming Tool: Linux, C/C++, Python, Rust, SQL, HTML, CSS, SCSS, JavaScript, \LaTeX, Markdown;
yue: 編程工具：Linux、C/C++、Python、Rust、SQL、HTML、CSS、SCSS、JavaScript、\LaTeX、Markdown；

source: Development Tool: Git, Docker, Kubernetes, OpenAPI, Postman, Swagger;
yue: 開發工具：Git、Docker、Kubernetes、OpenAPI、Postman、Swagger；

source: Development Framework: Flask, Django, Bootstrap, jQuery, Node.js.
yue: 開發框架：Flask、Django、Bootstrap、jQuery、Node.js。

source: Directory
yue: 目錄

source: items
yue: 項目

source: ABOUT:
yue: 關於：

source: Incorrect password
yue: 密碼錯誤

source: User not found
yue: 冇搵到呢個用戶

source: User already exists. Try a different one or log in.
yue: 用戶名已經存在。試下揀一個新嘅或者登入。

source: Email already exists. Try a different one or log in.
yue: 電郵已經存在。試下揀一個新嘅或者登入。

source: Account created. You can now log in.
yue: 帳戶已創建。你可以登入。

source: Username must be between 4 and 32 characters
yue: 賬戶名必須係 4 至 32 個字符之間

source: Password must be between 6 and 64 characters
yue: 密碼必須係 6 至 64 個字符之間

source: Passwords must match
yue: 密碼必須一致

source: Invalid email address
yue: 電郵地址無效

source: You have been logged out.
yue: 您已註銷。

source: Internal Server Error
yue: 內部伺服器錯誤

source: Not Implemented
yue: 未實施

source: Bad Gateway
yue: 網關錯誤

source: Joshua Ziyi Liu
yue: 劉子藝 Joshua

source: Curriculum Vitae
yue: 履歷

source: Contact Me
yue: 同我傾

source: You must be logged in to access this page.
yue: 您必須登入才能訪問此頁面。

source: You are not authorized to access this page.
yue: 您無權訪問此頁面。

source: Files
yue: 文件
